package operations.operators;

public class Test3 {
    public static void main(String[] args) {
        // Побитовое И
        int x = 112;
        // x: 00000000 00000000 00000000 01110000
        int y = 94;
        // y: 00000000 00000000 00000000 01011110
        int z = x & y;
        // z=80: 00000000 00000000 00000000 01010000
        System.out.println("z = " + z);

        // Побитовое ИЛИ
        int a = 112;
        // a: 00000000 00000000 00000000 01110000
        int b = 94;
        // b: 00000000 00000000 00000000 01011110
        int c = a | b;
        // c = 126: 00000000 00000000 00000000 01111110
        System.out.println("c = " + c);

        // Побитовое исключающее ИЛИ
        int i = 112;
        // i: 00000000 00000000 00000000 01110000
        int j = 94;
        // k: 00000000 00000000 00000000 01011110
        int k = i ^ j;
        // j = 46: 00000000 00000000 00000000 00101110
        System.out.println("k = " + k);
    }
}

