package operations.operators;

public class Test4 {
    public static void main(String[] args) {
        // Сдвиг влево с учетом знака
        int x = 31, z;
        // x: 00000000 00000000 00000000 00011111
        z = x << 2;
        // z = 124: 00000000 00000000 00000000 01111100
        System.out.println("z = " + z);

        // Сдвиг вправо с учетом знака
        int a = -17,b;
        // a: 11111111 11111111 11111111 11101111
        b = a >> 2;
        // b = -5: 11111111 11111111 11111111 11111011
        System.out.println("b = " + b);

        // Сдвиг вправо без учета знака
        int i = -17, k;
        // x: 11111111 11111111 11111111 11101111
        k = i >>> 2;
        // k = 1073741819
        // k: 00111111 11111111 11111111 11111011
        System.out.println("k = " + k);
    }
}


